Repository: Fluttify-App/fluttify-frontend
Catalog: lib/l10n/app_*.arb
Languages: de

# discoverdesc
source: Discover
de: Entdecken

source: Settings
de: Einstellungen

# privacy
source: Privacy Policy
de: Datenschutz

source: Delete Profile
de: Profil löschen

# licence
source: Licences
de: Lizenz

# signin
source: Sign In With Spotify
de: Anmelden mit Spotify

source: Created
de: Erstellt

source: Joined
de: Beigetreten

source: Contributors
de: Teilnehmer

source: Contributor
de: Teilnehmer

source: Genres
de: Genre

# selectedgenres
source: Select Genres
de: Genres auswählen

source: All Genres
de: Alle Genres

# liked
source: Following
de: Playlists, denen du folgst

# morecommunity
source: More from Community
de: Mehr von der Community

# discoversongs
source: Topsongs from other users
de: Topsongs anderer Nutzer

source: Dark Mode
de: Dunkles Design

source: Language
de: Sprache

source: Logout
de: Abmelden

source: Description
de: Beschreibung

source: Current Songs
de: Aktuelle Songs

source: Last Update:
de: Letztes Update:

source: Created by:
de: Erstellt von:

source: Playlist updating...
de: Playlist wird aktualisiert...

# leaveplaylist
source: Leave
de: Playlist verlassen

source: Join Playlist
de: Playlist beitreten

# joinedPlaylistSnackBar
source: Joined Playlist
de: Playlist beigetreten

# removePlaylistSnackBar
source: Playlist removed from library
de: Playlist aus der Bibliothek entfernt

# couldNotRemoveSnackBar
source: Could not remove playlist
de: Playlist konnte nicht entfernt werden

# likeplaylist
source: Follow
de: Playlist folgen

# unlikeplaylist
source: Unfollow
de: Playlist entfolgen

source: Remove User
de: Benutzer entfernen

# removeusercheck
source: Would you like to remove the User:
de: Willst du diesen Benutzer entfernen:

# leaveplaylistcheck
source: Would you like to leave playlist:
de: Willst du diese Playlist verlassen:

# logoutcheck
source: Would you like to logout from Fluttify?
de: Willst du dich abmelden?

# deleteplaylist
source: Remove playlist
de: Playlist entfernen

# deleteplaylistcheck
source: Would you like to remove playlist:
de: Willst du diese Playlist entfernen:

# playlistUpdateSnackBar
source: Playlist is getting updated
de: Playlist wird aktualisiert

source: No
de: Nein

source: Yes
de: Ja

source: Cancel
de: Abbrechen

source: Save
de: Speichern

# keepAllTracks
source: Keep Tracks
de: Behalte alle Songs

# infoDialog
source: Keep Tracks: The songs will not be replaced after a playlist update. The number of songs will grow with each update.
de: Songs bleiben in der Playlist. So kannst du zu einem späteren Zeitpunkt nochmal die Top Songs von dir und deinen Freunden hören.

# editKeepAllTracks
source: Please switch to edit-mode if you want to change the settings
de: Du kannst dies nur tun wenn du dich im Edit Modus befindest

source: Advanced Settings
de: Erweiterte Einstellungen

# welcome
source: Welcome to Fluttify
de: Willkommen zu Fluttify

# onboardingcontent1
source: Create auto-refreshing Spotify Playlists with your friends.
de: Erstelle selbst-aktualisierende Playlists mit deinen Freunden.

# onboardingtitle2
source: Create a Playlist
de: Erstelle eine Playlist

# onboardingcontent2
source: Choose a playlist name and description. Aditionally you can specify the desired music genres for the playlist or allow all genres. The playlist will be automatically added to your Spotify Library.
de: Wähle einen Namen und optional eine Beschreibung. Du entscheidest welche Songs in die Playlist kommen anhand der Genres. Die Playlist wird automatisch deiner Spotify Bibliothek hinzugefügt.

# onboardingtitle3
source: Invite your friends
de: Lade deine Freunde ein

# onboardingcontent3
source: Press the share button on a playlist to invite your friends. You can share via WhatsApp or other messengers. Your friends can join your playlist by opening the Fluttify invitation link.
de: Drücke auf den Share-Button um deine Freunde einzuladen. Alle sozialen Medien stehen dir zur Verfügung. Deine Freunde können deiner Playlist über den Einladungslink beitreten.

# onboardingtitle4
source: Fluttify Algorithm
de: Fluttify Algorithmus

# onboardingcontent4
source: Fluttify uses the Spotify API to automatically collect songs for your playlist. It adds the recently-liked and frequently-listened songs of each playlist-contributor that match with the specified genre. You can decide if these songs will stay in your playlist or get replaced after the next refresh.
de: Fluttify benutzt die Spotify API um Songs auszuwählen, die der Playlist hinzugefügt werden. Es werden die zuletzt gespeicherten und häufig gehörten Songs aller Teilnehmer ausgewählt und der Playlist hinzugefügt. Du entscheidest, ob alle Songs nach dem nächsten Aktualisieren in der Playlist bleiben oder überschrieben werden.

# onboardingtitle5
source: Lean back & enjoy your favorites
de: Lehn dich zurück & genieße deine Lieblingssongs

# onboardingcontent5
source: Fluttify refreshes your playlist automatically every 24 hours. Your playlists will always be up-to-date! Have Fun using Fluttify!
de: Fluttify aktualisiert deine Playlists alle 24 Stunden automatisch. Deine Playlist wird immer auf dem neusten Stand sein! Viel Spaß mit Fluttify!
